content/notes/derivatives.org
#+title: Derivatives

* Derivatives
:PROPERTIES:
:CUSTOM_ID: derivatives
:END:
** Chain Rule
:PROPERTIES:
:CUSTOM_ID: chain-rule
:END:
The chain rule is a formula the expresses the derivative of the
composition of two functions \(f\) and \(g\) in terms of the derivatives
of \(f\) and \(g\). Therefore if we want to find the derivative of
\(h(x) = f(g(x))\) then

\begin{equation}
\begin{array}{l}
    h'(x) = f'(g(x))g'(x) \\
    \text{or equivalently} \\
    h' = f(h \circ g)' = (f' \circ g)\cdot g' \\
\end{array}
\end{equation}

** Product Rule
:PROPERTIES:
:CUSTOM_ID: product-rule
:END:
The product rule (also known as the Leibniz rule or Leibniz product
rule) is a formula used to find the derivative of products of two or
more functions.

\begin{equation}
\begin{array}{l}
    (uv)' = u'*v + u*v'             \\
    \text{or in Leibniz's notation} \\
    \frac{d(uv)}{dx} = \frac{du}{dz}v + u \frac{dv}{dx} \\
\end{array}
\end{equation}

** Sources
:PROPERTIES:
:CUSTOM_ID: sources
:END:
- [[https://en.wikipedia.org/wiki/Chain_rule.md][Chain Rule]]
- [[https://en.wikipedia.org/wiki/Product_rule.md][Product Rule]]
