docs/derivatives.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-19 Sat 18:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#derivatives">1. Derivatives</a>
<ul>
<li><a href="#chain-rule">1.1. Chain Rule</a></li>
<li><a href="#product-rule">1.2. Product Rule</a></li>
<li><a href="#sources">1.3. Sources</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-derivatives" class="outline-2">
<h2 id="derivatives"><span class="section-number-2">1.</span> Derivatives</h2>
<div class="outline-text-2" id="text-derivatives">
</div>
<div id="outline-container-chain-rule" class="outline-3">
<h3 id="chain-rule"><span class="section-number-3">1.1.</span> Chain Rule</h3>
<div class="outline-text-3" id="text-chain-rule">
<p>
The chain rule is a formula the expresses the derivative of the
composition of two functions \(f\) and \(g\) in terms of the derivatives
of \(f\) and \(g\). Therefore if we want to find the derivative of
\(h(x) = f(g(x))\) then
</p>

<p>
\[
</p>
\begin{array}{l}
    h'(x) = f'(g(x))g'(x) \\
    \text{or equivalently} \\
    h' = f(h \circ g)' = (f' \circ g)\cdot g' \\
\end{array}
<p>
\]
</p>
</div>
</div>

<div id="outline-container-product-rule" class="outline-3">
<h3 id="product-rule"><span class="section-number-3">1.2.</span> Product Rule</h3>
<div class="outline-text-3" id="text-product-rule">
<p>
The product rule (also known as the Leibniz rule or Leibniz product
rule) is a formula used to find the derivative of products of two or
more functions.
</p>

<p>
\[
</p>
\begin{array}{l}
    (uv)' = u'*v + u*v'             \\
    \text{or in Leibniz's notation} \\
    \frac{d(uv)}{dx} = \frac{du}{dz}v + u \frac{dv}{dx} \\
\end{array}
<p>
\]
</p>
</div>
</div>

<div id="outline-container-sources" class="outline-3">
<h3 id="sources"><span class="section-number-3">1.3.</span> Sources</h3>
<div class="outline-text-3" id="text-sources">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Chain_rule.md">Chain Rule</a></li>
<li><a href="https://en.wikipedia.org/wiki/Product_rule.md">Product Rule</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2022-11-19 Sat 18:47</p>
</div>
</body>
</html>
